ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/vs_Доизготовление/vs_Доизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>vs_Доизготовление</name>
  <resources>
    <name>Доизготовить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция vs_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ВнутреннееПотребление") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаЗаказыНаВнутреннееПотребление(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаМатериалыИРаботыВПроизводстве(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыОрганизаций(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыОрганизацийКПередаче(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТоварыКОформлениюОтчетовКомитенту(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаДвиженияНоменклатураДоходыРасходы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры);
		
		//++ НЕ УТ
		ТекстЗапросаТаблицаДокументыПоОС(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаТМЦВЭксплуатации(Запрос, ТекстыЗапроса, Регистры);
		//-- НЕ УТ
		
		ВнутреннееПотреблениеЛокализация.ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры);
	ОформитьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеДокументов.ДобавитьЗапросыСторноДвижений(
		Запрос, ТекстыЗапроса, Регистры, Метаданные.Документы.ВнутреннееПотребление);
	РасчетСебестоимостиПроведениеДокументов.ОтразитьВМеханизмеУчетаЗатратИСебестоимости(
		ДокументСсылка, Запрос, ТекстыЗапроса, Регистры);
#Вставка
		Если Запрос.Параметры.vs_ЭтоДоизготовление Тогда
			//Для Каждого ТЗ из ТекстыЗапроса Цикл
			//	ТЗ.Пометка = Ложь;	
			//КонецЦикла;
			ТекстЗапросаТаблицаДоизготовление(Запрос, ТекстыЗапроса, Регистры);
			//ДопПараметры.ТолькоПомеченные = Истина;
		КонецЕсли;	
#КонецВставки
		
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыВыбораСтатейИАналитик_vs_Доизготовление(ХозяйственнаяОперация) Экспорт
	
	ПараметрыВыбора = ДоходыИРасходыСервер.ПараметрыВыбораСтатьиИАналитики();
	ПараметрыВыбора.ПутьКДанным = "Объект.vs_Доизготовление";
	ПараметрыВыбора.Статья = "СтатьяРасходов";
	ПараметрыВыбора.ТипСтатьи = "ТипСтатьи";
	
	ПараметрыВыбора.ВыборСтатьиРасходов = Истина;
	ПараметрыВыбора.АналитикаРасходов = "АналитикаРасходов";
	
	//ПараметрыВыбора.ВыборСтатьиАктивовПассивов = Истина;
	//ПараметрыВыбора.АналитикаАктивовПассивов = "АналитикаАктивовПассивов";
	
	ПараметрыВыбора.ЭлементыФормы.Статья.Добавить("vs_ДоизготовлениеСтатьяРасходов");
	ПараметрыВыбора.ЭлементыФормы.АналитикаРасходов.Добавить("vs_ДоизготовлениеАналитикаРасходов");
	//ПараметрыВыбора.ЭлементыФормы.АналитикаАктивовПассивов.Добавить("ТоварыАналитикаАктивовПассивов");
	
	////////////ВнутреннееПотреблениеЛокализация.ПараметрыВыбораСтатейИАналитик(  ????????????????????????????????????????????
	////////////	ПараметрыВыбора,
	////////////	ХозяйственнаяОперация);
	
	Возврат ПараметрыВыбора;
	
КонецФункции

#КонецОбласти
#КонецЕсли

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

&ИзменениеИКонтроль("ЗаполнитьПараметрыИнициализации")
Процедура vs_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Дата                           КАК Период,
	|	Таблица.Номер                          КАК Номер,
	|	Таблица.Организация                    КАК Организация,
	|	Таблица.Склад                          КАК Склад,
	|	Таблица.Ссылка                         КАК Ссылка,
	|	Таблица.Подразделение                  КАК Подразделение,
	|	ЕСТЬNULL(Таблица.Подразделение.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка)) КАК ВариантОбособленногоУчетаТоваров,
	|	Таблица.Дата                           КАК ДатаРаспоряжения,
	|	Таблица.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	Таблица.ЗаказНаВнутреннееПотребление   КАК ЗаказНаВнутреннееПотребление,
	|	Таблица.ПотреблениеПоЗаказам           КАК ПоЗаказуНаВнутреннееПотребление,
	|	Таблица.ПотреблениеДляДеятельности     КАК ПотреблениеДляДеятельности,
	|	Таблица.НаправлениеДеятельности        КАК НаправлениеДеятельности,
	|	Таблица.Ответственный                  КАК Менеджер,
	|	Таблица.Сделка                         КАК Сделка,
	|	ЕСТЬNULL(Таблица.Сделка.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ) КАК ОбособленныйУчетТоваровПоСделке,
	|	ВЫБОР
	|		КОГДА Таблица.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Таблица.Дата >= Таблица.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                  КАК ОрдернаяСхемаПриОтгрузке,
	|	Таблица.Ответственный                  КАК Ответственный,
	|	Таблица.Комментарий                    КАК Комментарий,
	|	Таблица.Исправление                    КАК Исправление,
	|	Таблица.СторнируемыйДокумент           КАК СторнируемыйДокумент,
	|	Таблица.ИсправляемыйДокумент           КАК ИсправляемыйДокумент,
	|	Таблица.ПометкаУдаления                КАК ПометкаУдаления,
	|	Таблица.Проведен                       КАК Проведен,
	|	Таблица.Статус                         КАК Статус,
#Вставка
	// Здесь можно описать новое поведение.
	|	Таблица.vs_СтатьяРасходов              КАК vs_СтатьяРасходов,
	|	Таблица.vs_АктИзготовления             КАК vs_АктИзготовления,
	|	Таблица.vs_ЭтоДоизготовление           КАК vs_ЭтоДоизготовление,
	|	Таблица.vs_Статус                      КАК vs_Статус,
	|	Таблица.ИТБК_АктИзготовления           КАК ИТБК_АктИзготовления,
	|	Таблица.ИТБК_ЭтоДоизготовление         КАК ИТБК_ЭтоДоизготовление,
	|	Таблица.ИТБК_Статус                    КАК ИТБК_Статус,
#КонецВставки
	|	НастройкиХозяйственныхОпераций.Ссылка  КАК НастройкаХозяйственнойОперации
	|ИЗ
	|	Документ.ВнутреннееПотребление КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|		ПО Таблица.ХозяйственнаяОперация = НастройкиХозяйственныхОпераций.ХозяйственнаяОперация
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";

	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
#Вставка
	// Здесь можно описать новое поведение.
	Запрос.УстановитьПараметр("vs_СтатьяРасходов",                Реквизиты.vs_СтатьяРасходов);
	Запрос.УстановитьПараметр("vs_АктИзготовления",               Реквизиты.vs_АктИзготовления);
	Запрос.УстановитьПараметр("vs_ЭтоДоизготовление",             Реквизиты.vs_ЭтоДоизготовление);
	Запрос.УстановитьПараметр("vs_Статус",                        Реквизиты.vs_Статус);
	Запрос.УстановитьПараметр("ИТБК_АктИзготовления",             Реквизиты.ИТБК_АктИзготовления);
	Запрос.УстановитьПараметр("ИТБК_ЭтоДоизготовление",           Реквизиты.ИТБК_ЭтоДоизготовление);
	Запрос.УстановитьПараметр("ИТБК_Статус",     				  Реквизиты.ИТБК_Статус);
	Запрос.УстановитьПараметр("ДатаКон",                          Новый Граница(Новый МоментВремени(Реквизиты.Период, Реквизиты.Ссылка), ВидГраницы.Исключая));
#КонецВставки

	Запрос.УстановитьПараметр("Склад",                            Реквизиты.Склад);
	Запрос.УстановитьПараметр("Период",                           Реквизиты.Период);
	Запрос.УстановитьПараметр("ДатаРаспоряжения",                 Реквизиты.ДатаРаспоряжения);
	Запрос.УстановитьПараметр("Организация",                      Реквизиты.Организация);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",            Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("ОрдернаяСхемаПриОтгрузке",         Реквизиты.ОрдернаяСхемаПриОтгрузке);
	Запрос.УстановитьПараметр("ЗаказНаВнутреннееПотребление",     Реквизиты.ЗаказНаВнутреннееПотребление);
	Запрос.УстановитьПараметр("ПоЗаказуНаВнутреннееПотребление",  Реквизиты.ПоЗаказуНаВнутреннееПотребление);
	Запрос.УстановитьПараметр("Сделка",                           Реквизиты.Сделка);
	Запрос.УстановитьПараметр("ОбособленныйУчетТоваровПоСделке",  Реквизиты.ОбособленныйУчетТоваровПоСделке);
	Запрос.УстановитьПараметр("ВариантОбособленногоУчетаТоваров", Реквизиты.ВариантОбособленногоУчетаТоваров);
	Запрос.УстановитьПараметр("Подразделение",                    Реквизиты.Подразделение);
	Запрос.УстановитьПараметр("ПотреблениеДляДеятельности",       Реквизиты.ПотреблениеДляДеятельности);
	Запрос.УстановитьПараметр("НаправлениеДеятельности",          Реквизиты.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Менеджер",                         Реквизиты.Менеджер);
	Запрос.УстановитьПараметр("Валюта",                           Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	Запрос.УстановитьПараметр("ПустойКлючСвязи",                  Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.УстановитьПараметр("ПустаяСерия",                      Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеНазначение",                 Справочники.Назначения.ПустаяСсылка());

	Запрос.УстановитьПараметр("СкладскаяОперация", Перечисления.СкладскиеОперации.ОтгрузкаНаВнутренниеНужды);

	Запрос.УстановитьПараметр("Номер",                            Реквизиты.Номер);
	Запрос.УстановитьПараметр("Ответственный",                    Реквизиты.Ответственный);
	Запрос.УстановитьПараметр("Комментарий",                      Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",                  Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                         Реквизиты.Проведен);

	Запрос.УстановитьПараметр("Исправление",                      Реквизиты.Исправление);
	Запрос.УстановитьПараметр("СторнируемыйДокумент",             Реквизиты.СторнируемыйДокумент);
	Запрос.УстановитьПараметр("ИсправляемыйДокумент",             Реквизиты.ИсправляемыйДокумент);

	Запрос.УстановитьПараметр("НастройкаХозяйственнойОперации",   Реквизиты.НастройкаХозяйственнойОперации);
	Запрос.УстановитьПараметр("Статус",                           Реквизиты.Статус);

	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла; 

	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);

	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);

КонецПроцедуры

Функция ТекстЗапросаТаблицаДоизготовление(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "vs_Доизготовление";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&Ссылка КАК Регистратор,
	               |	&Период КАК Период,
	               |	ТаблицаТовары.Ссылка.vs_АктИзготовления КАК АктИзготовления,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.Характеристика КАК Характеристика,
	               |	СУММА(ТаблицаТовары.ТребуетсяДоизготовить) КАК ТребуетсяДоизготовить,
	               |	СУММА(ТаблицаТовары.Количество) КАК Количество,
	               |	СУММА(ТаблицаТовары.Отказ) КАК Отказ
	               |ПОМЕСТИТЬ ВтДокумента
	               |ИЗ
	               |	Документ.ВнутреннееПотребление.vs_Доизготовление КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаТовары.Ссылка.vs_АктИзготовления,
	               |	ТаблицаТовары.Номенклатура,
	               |	ТаблицаТовары.Характеристика,
	               |	ТаблицаТовары.Ссылка.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДДокумента.Регистратор КАК Регистратор,
	               |	ДДокумента.Период КАК Период,
	               |	ДДокумента.АктИзготовления КАК АктИзготовления,
	               |	ДДокумента.Номенклатура КАК Номенклатура,
	               |	ДДокумента.Характеристика КАК Характеристика,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0) > 0
	               |				ТОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ДоизготовитьОстаток,
	               |	СУММА(ДДокумента.ТребуетсяДоизготовить) КАК ТребуетсяДоизготовить,
	               |	СУММА(ДДокумента.Количество) КАК Количество,
	               |	СУММА(ДДокумента.Отказ) КАК Отказ,
	               |	ВЫБОР
	               |		КОГДА НЕ СУММА(ВЫБОР
	               |						КОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0) > 0
	               |							ТОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)
	               |						ИНАЧЕ 0
	               |					КОНЕЦ) > 0
	               |			ТОГДА СУММА(0)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ СУММА(ДДокумента.Количество) > ВЫБОР
	               |							КОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)) > 0
	               |								ТОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0))
	               |							ИНАЧЕ 0
	               |						КОНЕЦ - СУММА(ДДокумента.Отказ)
	               |					ТОГДА СУММА(ДДокумента.Количество)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)) > 0
	               |							ТОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0))
	               |						ИНАЧЕ 0
	               |					КОНЕЦ - СУММА(ДДокумента.Отказ)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК РасчетноеДоизготовить,
	               |	ВЫБОР
	               |		КОГДА СУММА(ДДокумента.Количество) + СУММА(ДДокумента.Отказ) > ВЫБОР
	               |					КОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)) > 0
	               |						ТОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0))
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |			ТОГДА СУММА(ДДокумента.Количество) + СУММА(ДДокумента.Отказ) - ВЫБОР
	               |					КОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)) > 0
	               |						ТОГДА СУММА(ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0))
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ СУММА(0)
	               |	КОНЕЦ КАК РасчетноеДоизготовить1,
	               |	СУММА(ДДокумента.Отказ) КАК РасчетноеОтказ
	               |ПОМЕСТИТЬ ВтДокумента_vs_Доизготовление
	               |ИЗ
	               |	ВтДокумента КАК ДДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.vs_Доизготовление.Остатки(
	               |				&ДатаКон,
	               |				(АктИзготовления, Номенклатура) В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						Т.АктИзготовления,
	               |						Т.Номенклатура
	               |					ИЗ
	               |						ВтДокумента КАК Т)) КАК vs_Доизготовление
	               |		ПО ДДокумента.АктИзготовления = vs_Доизготовление.АктИзготовления
	               |			И ДДокумента.Номенклатура = vs_Доизготовление.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДДокумента.Регистратор,
	               |	ДДокумента.Период,
	               |	ДДокумента.АктИзготовления,
	               |	ДДокумента.Номенклатура,
	               |	ДДокумента.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВтДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	ВтДД.Регистратор КАК Регистратор,
	               |	ВтДД.Период КАК Период,
	               |	ВтДД.АктИзготовления КАК АктИзготовления,
	               |	ВтДД.Номенклатура КАК Номенклатура,
	               |	ВтДД.Характеристика КАК Характеристика,
	               |	СУММА(ВтДД.РасчетноеДоизготовить) КАК Доизготовить
	               |ИЗ
	               |	ВтДокумента_vs_Доизготовление КАК ВтДД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВтДД.РасчетноеДоизготовить) > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика,
	               |	-СУММА(ВтДД.РасчетноеОтказ)
	               |ИЗ
	               |	ВтДокумента_vs_Доизготовление КАК ВтДД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВтДД.РасчетноеОтказ) > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика,
	               |	СУММА(ВтДД.РасчетноеДоизготовить1)
	               |ИЗ
	               |	ВтДокумента_vs_Доизготовление КАК ВтДД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВтДД.РасчетноеДоизготовить1) > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика,
	               |	СУММА(ВтДД.РасчетноеДоизготовить1)
	               |ИЗ
	               |	ВтДокумента_vs_Доизготовление КАК ВтДД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВтДД.Регистратор,
	               |	ВтДД.Период,
	               |	ВтДД.АктИзготовления,
	               |	ВтДД.Номенклатура,
	               |	ВтДД.Характеристика
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВтДД.РасчетноеДоизготовить1) > 0";
		
	//ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра, Истина);
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
